zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f407v(e-g-k)xx-pinctrl.h
/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AF('D', 11, AF12)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AF('D', 12, AF12)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AF('D', 13, AF12)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AF('E', 3, AF12)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AF('E', 4, AF12)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AF('E', 5, AF12)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AF('E', 6, AF12)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AF('E', 2, AF12)

/* EXMC_ALE */
#define EXMC_ALE_PD12 \
	GD32_PINMUX_AF('D', 12, AF12)

/* EXMC_CLE */
#define EXMC_CLE_PD11 \
	GD32_PINMUX_AF('D', 11, AF12)

/* EXMC_CLK */
#define EXMC_CLK_PD3 \
	GD32_PINMUX_AF('D', 3, AF12)

/* EXMC_D0 */
#define EXMC_D0_PD14 \
	GD32_PINMUX_AF('D', 14, AF12)

/* EXMC_D1 */
#define EXMC_D1_PD15 \
	GD32_PINMUX_AF('D', 15, AF12)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AF('E', 13, AF12)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AF('E', 14, AF12)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AF('E', 15, AF12)

/* EXMC_D13 */
#define EXMC_D13_PD8 \
	GD32_PINMUX_AF('D', 8, AF12)

/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AF('D', 9, AF12)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AF('D', 10, AF12)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AF('D', 0, AF12)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AF('D', 1, AF12)

/* EXMC_D4 */
#define EXMC_D4_PE7 \
	GD32_PINMUX_AF('E', 7, AF12)

/* EXMC_D5 */
#define EXMC_D5_PE8 \
	GD32_PINMUX_AF('E', 8, AF12)

/* EXMC_D6 */
#define EXMC_D6_PE9 \
	GD32_PINMUX_AF('E', 9, AF12)

/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AF('E', 10, AF12)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AF('E', 11, AF12)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AF('E', 12, AF12)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AF('E', 0, AF12)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AF('E', 1, AF12)

/* EXMC_NCE1 */
#define EXMC_NCE1_PD7 \
	GD32_PINMUX_AF('D', 7, AF12)

/* EXMC_NE0 */
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AF('D', 7, AF12)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NOE */
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AF('D', 4, AF12)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AF('D', 6, AF12)

/* EXMC_NWE */
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)

/* EXMC_SDCKE0 */
#define EXMC_SDCKE0_PC3 \
	GD32_PINMUX_AF('C', 3, AF12)
#define EXMC_SDCKE0_PC5 \
	GD32_PINMUX_AF('C', 5, AF12)

/* EXMC_SDCKE1 */
#define EXMC_SDCKE1_PB5 \
	GD32_PINMUX_AF('B', 5, AF12)

/* EXMC_SDNE0 */
#define EXMC_SDNE0_PC2 \
	GD32_PINMUX_AF('C', 2, AF12)
#define EXMC_SDNE0_PC4 \
	GD32_PINMUX_AF('C', 4, AF12)

/* EXMC_SDNE1 */
#define EXMC_SDNE1_PB6 \
	GD32_PINMUX_AF('B', 6, AF11)

/* EXMC_SDNWE */
#define EXMC_SDNWE_PC0 \
	GD32_PINMUX_AF('C', 0, AF12)

/* EXMC_SD_NWE */
#define EXMC_SD_NWE_PA7 \
	GD32_PINMUX_AF('A', 7, AF12)

/* I2C0_SCL */
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)
#define I2C0_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF4)

/* I2C0_SDA */
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define I2C0_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF4)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AF('B', 10, AF4)

/* I2C1_SDA */
#define I2C1_SDA_PB3 \
	GD32_PINMUX_AF('B', 3, AF9)
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AF('B', 11, AF4)
#define I2C1_SDA_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AF('B', 12, AF4)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AF('B', 13, AF4)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AF('B', 4, AF9)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)

/* I2C2_TXFRAME */
#define I2C2_TXFRAME_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define I2S1_ADD_SD_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)

/* I2S1_CK */
#define I2S1_CK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define I2S1_CK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define I2S1_CK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define I2S1_CK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)
#define I2S1_CK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define I2S1_MCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF5)

/* I2S1_SD */
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define I2S1_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define I2S1_SD_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)

/* I2S1_WS */
#define I2S1_WS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)
#define I2S1_WS_PD1 \
	GD32_PINMUX_AF('D', 1, AF7)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define I2S2_ADD_SD_PC11 \
	GD32_PINMUX_AF('C', 11, AF5)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define I2S2_CK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* I2S2_MCK */
#define I2S2_MCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF6)

/* I2S2_SD */
#define I2S2_SD_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define I2S2_SD_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define I2S2_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define I2S2_SD_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define I2S2_SD_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)
#define I2S2_SD_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* I2S_CKIN */
#define I2S_CKIN_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define I2S_CKIN_PB11 \
	GD32_PINMUX_AF('B', 11, AF5)
#define I2S_CKIN_PC9 \
	GD32_PINMUX_AF('C', 9, AF5)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* NJTRST */
#define NJTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

